//-------------------------------------------------------
// 2023 1학기 STL 5월 2일 (9주 2)
//-------------------------------------------------------
// 반복자(Iterator) - 포인터를 일반화한 것
// 반복자 카테고리 - 입력/출력/전방향/양방향/랜덤억세스/컨티구어스
//-------------------------------------------------------
// 코딩환경 - VS Release/x64, C++표준 - latest, SDL/아니오
//-------------------------------------------------------

#include <iostream>
#include "save.h"
#include "String.h"

using namespace std;
extern bool 관찰;

int main()
{
	// 출력반복자를 만들어서 동작을 관찰 이해해 본다
	// -> 출력반복자 어댑터를 사용해서 관찰
	ostream_iterator<char> p{ cout };
	*p = 'A';
	++p;
	*p = 'B';
	++p;
	*p = 'C';
	++p;
	*p = '\n';
	++p;

	//save("main.cpp");
}