//-------------------------------------------------------
// 2023 1학기 STL 3월 27일 (4주 1)
//-------------------------------------------------------
// 정렬(sort) - Callable type(호출가능타입)
// 1. 함수(함수 포인터)
// 2. 함수 객체(함수호출 연산자()를 오버로딩한 클래스)
// 3. 람다(이름없는 함수)
// 4. 멤버함수 포인터
// 
// 전체를 추상화 한(대표하는) 클래스 -> function
//-------------------------------------------------------
// 코딩환경 - VS Release/x64, C++표준 - latest, SDL/아니오
//-------------------------------------------------------

#include <iostream>
#include <functional>
#include "save.h"

int main()
{
	save("main.cpp");

	std::function<int(void)> f = main;

	std::cout << sizeof(f) << '\n'; // 64byte
}
