//-------------------------------------------------------
// 2023 1학기 STL 4월 24일 (8주 1)
// 4월 25일 - (8주 2) 중간시험
//-------------------------------------------------------
// Sequence Container - forward_list
// 직접 작성한 C-style의 단일 연결 리스트보다 조금의 공강이나 시간의
// 오버헤드가 없도록 설계한 컨테이너이다. 이것에 위반하는 코드는 아예
// 제공하지 않는다.
//-------------------------------------------------------
// 코딩환경 - VS Release/x64, C++표준 - latest, SDL/아니오
//-------------------------------------------------------

#include <iostream>
#include <forward_list>
#include "save.h"
#include "String.h"

using namespace std;

extern bool 관찰;

int main()
{
	

	//save("main.cpp");
}