//-------------------------------------------------------
// 2023 1학기 STL 3월 20일 (3주 1)
//-------------------------------------------------------
// STACK의 한계
//-------------------------------------------------------
// 코딩환경 - VS Release/x64, C++표준 - latest, SDL/아니오
//-------------------------------------------------------

#include <iostream>
#include <array>
#include "save.hpp"

int main()
{
	// 여기에서 객체를 생성 -> STACK에 생성
	std::array<int, 1'000> a;	// 4kB
	std::cout << sizeof(a) << '\n';

	 save("main.cpp");
	git_commit("3주 1차 시작");
}